[
  {
    "id": "schedule-0oc851a",
    "type": "QUALIFYING",
    "matches": [
      {
        "id": "match-08zpmx3",
        "name": "Match 1",
        "participants": [
          {
            "id": "part-qpm0bjg",
            "introText": "“He may be beautiful, but don’t get too close — those petals are hiding punishment! He’s blooming back into the arena to reclaim his crown — make way for Black Rose!”"
          },
          {
            "id": "part-hh5ch23",
            "introText": "“He doesn’t talk trash — he crushes it. From the pits of Auckland and built like a freight train, it’s the one, the only, Borris!”"
          }
        ],
        "winner": {
          "id": "part-hh5ch23",
          "condition": "JD"
        }
      },
      {
        "id": "match-cl2qls1",
        "name": "Match 2",
        "participants": [
          {
            "id": "part-uov2lni",
            "introText": "“He spins, he slides, he shreds! This melty brain brings total disorientation to every rotation — Auckland, make some noise for Chain Damage!”"
          },
          {
            "id": "3osxali",
            "introText": "“He doesn’t drive — he dances! This melty brain spins like geometry on caffeine and hits like chaos in motion — it’s the swirling storm called Tessellate!”"
          }
        ],
        "winner": {
          "id": "3osxali",
          "condition": "KO"
        }
      },
      {
        "id": "match-s2lx7qa",
        "name": "Match 3",
        "participants": [
          {
            "id": "puvpwxl",
            "introText": "“He’s not here to sneak — he’s here to strike! Quick on his feet and ruthless with the hits, he’s out for redemption and ready to rage — this is Fury Fox!”"
          },
          {
            "id": "part-dllub2q",
            "introText": "“He’s not just bringing the hammer — he is the hammer! With power from the gods and strikes from the depths, brace yourself for the storm called Mjolnir!”"
          }
        ],
        "winner": {
          "id": "part-dllub2q",
          "condition": "KO"
        }
      },
      {
        "id": "match-cfbi25r",
        "name": "Match 4",
        "participants": [
          {
            "id": "part-aw653qy",
            "introText": "“One bot causes problems. Two? They create pure anarchy! These misfits from the North and South have teamed up for maximum madness — it's the tag-team terror of Snollygoster and Ragamuffin!”"
          },
          {
            "id": "8pii4jf",
            "introText": "“He’ll tuck you in — permanently! From the land of koalas and chaos, this hammersaw monster is here to lull you to your doom — nighty-night from Naptime!”"
          }
        ],
        "winner": {
          "id": "part-aw653qy",
          "condition": "KO"
        }
      },
      {
        "id": "match-ilg9gpv",
        "name": "Match 5",
        "participants": [
          {
            "id": "s9xj92s"
          },
          {
            "id": "96j1t3r"
          }
        ],
        "winner": {
          "id": "s9xj92s",
          "condition": "JD"
        }
      },
      {
        "id": "match-50cb9sz",
        "name": "Match 6",
        "participants": [
          {
            "id": "rot076r",
            "introText": "“He’s not just swinging for points — he’s swinging for pain! Built in Auckland and driven with rage, this bot’s about to throw hands — say hello to Haymaker!”"
          },
          {
            "id": "part-odwrzot",
            "introText": "“He’s carved from timber but built to destroy! This isn’t your grandma’s kitchen — he’s serving up carnage with a side of splinters — it’s the one and only Chef Woody!”"
          }
        ],
        "winner": {
          "id": "rot076r",
          "condition": "JD"
        }
      },
      {
        "id": "match-iqsbbmx",
        "name": "Match 7",
        "participants": [
          {
            "id": "part-dx6qvml",
            "introText": "“Every lever needs a pivot — and every fight needs a reckoning! She lifts, she slams, she crushes with precision — here comes the force behind the chaos: Fulcrum!”"
          },
          {
            "id": "part-fdrxhj5",
            "introText": "This bot’s got more bite than bark — slicing, dicing, and deleting the competition one byte at a time! Make some noise for… KILLABYYYYTE!"
          }
        ],
        "winner": {
          "id": "part-fdrxhj5",
          "condition": "JD"
        }
      },
      {
        "id": "match-qcmkj45",
        "name": "Match 8",
        "participants": [
          {
            "id": "part-y3konnp",
            "introText": "“No knives, no spoons — just the sharpest forks in the fight! He’s lifting bots and lifting expectations — it’s time to dine on destruction with OnlyForks!”"
          },
          {
            "id": "uvy1k73",
            "introText": "“He may look cute, but don’t be fooled — this Aussie export is all killer and no filler. Get ready for eggbeaters, chaos, and mayhem — here comes Perry!”"
          }
        ],
        "winner": {
          "id": "uvy1k73",
          "condition": "KO"
        }
      },
      {
        "id": "match-i8kf3sa",
        "name": "Match 9",
        "participants": [
          {
            "id": "hfk4hiu",
            "introText": "“The suspense is building… the beat is rising… and now it’s time for the drop! Hold your applause — and your bots — for Drumroll Pls!”"
          },
          {
            "id": "luecccm",
            "introText": "“He’s fast, he’s fierce, and he’s leaving sparks in his wake. You won’t see him coming — but you’ll feel the impact of Blue Blur!”"
          }
        ],
        "winner": {
          "id": "hfk4hiu",
          "condition": "KO"
        }
      },
      {
        "id": "match-opyvny7",
        "name": "Match 10",
        "participants": [
          {
            "id": "part-04xspbq",
            "introText": "“When this bot enters the ring, old scores get settled and new grudges are born. He’s here to turn rivalries into wreckage — bring the heat for Bad Blood!”"
          },
          {
            "id": "0a41c0a",
            "introText": "“From the outback to the outbreak, this Aussie menace brings absolute annihilation. The name says it all — brace yourself for the unstoppable Obliterator!”"
          }
        ],
        "winner": {
          "id": "0a41c0a",
          "condition": "KO"
        }
      }
    ],
    "name": "Qualifying Session 1"
  },
  {
    "id": "schedule-n52v5ix",
    "type": "QUALIFYING",
    "matches": [
      {
        "id": "match-265femo",
        "name": "Match 1",
        "participants": [
          {
            "id": "part-aw653qy",
            "introText": "“You thought one was bad? These two bring twice the trouble, twice the chaos, and twice the fun. It’s double the danger with Snollygoster and Ragamuffin!”"
          },
          {
            "id": "uvy1k73",
            "introText": "“From the land of kangaroos and chaos comes a spinner with serious bite — stealthy, deadly, and dangerously adorable — give it up for Perry!”"
          }
        ],
        "winner": {
          "id": "uvy1k73",
          "condition": "JD"
        }
      },
      {
        "id": "match-jve4ev1",
        "name": "Match 2",
        "participants": [
          {
            "id": "part-dx6qvml",
            "introText": "“She’s not here to play fair — she’s here to flip your world upside down! She’s the hammer and the hinge — make some noise for Fulcrum!”"
          },
          {
            "id": "8pii4jf",
            "introText": "“This isn’t rest — it’s ruin. He’s cutting deep and coming fast, and if you blink… you’re already dreaming. Lights out — it’s Naptime!”"
          }
        ],
        "winner": {
          "id": "8pii4jf",
          "condition": "KO"
        }
      },
      {
        "id": "match-90tzs2j",
        "name": "Match 3",
        "participants": [
          {
            "id": "puvpwxl",
            "introText": "“Don’t mistake his silence for mercy — this fox is furious and focused, and he’s bringing the heat from Auckland’s underground. Give it up for Fury Fox!”"
          },
          {
            "id": "part-uov2lni",
            "videoName": "Chain_Damage_A.mov",
            "introText": "Spinning at full speed and bringing the pain with every swing — this melty bot from Auckland is ready to rattle the competition! Give it up for… CHAIN DAMAAAAGE!"
          }
        ],
        "winner": {
          "id": "puvpwxl",
          "condition": "KO"
        }
      },
      {
        "id": "match-bv01dcq",
        "name": "Match 4",
        "participants": [
          {
            "id": "luecccm",
            "introText": "“From Auckland’s edge to the heart of the arena, this speedster’s spinning to win — blink and you’ll miss Blue Blur!”"
          },
          {
            "id": "part-y3konnp",
            "videoName": "Onlyforks_A.mov",
            "introText": "“When the other utensils ran, he stayed to scrap. He’s flipping bots and flippin’ mad — sharpen your senses for OnlyForks!”"
          }
        ],
        "winner": {
          "id": "part-y3konnp",
          "condition": "KO"
        }
      },
      {
        "id": "match-tv86f5h",
        "name": "Match 5",
        "participants": [
          {
            "id": "part-qpm0bjg",
            "videoName": "Black_Rose_A.mov",
            "introText": "“From the garden of nightmares and straight into your gearbox — a former champion who fights with grace and grinds with fury — it’s the delicate but deadly Black Rose!”"
          },
          {
            "id": "part-odwrzot",
            "videoName": "Chef_Woody_A.mov",
            "introText": "“Forget steel — he’s made of wood and bad intentions! Cooking up chaos with every collision, fire up the grill for Chef Woody!”"
          }
        ],
        "winner": {
          "id": "part-qpm0bjg",
          "condition": "KO"
        }
      },
      {
        "id": "match-u9r64fb",
        "name": "Match 6",
        "participants": [
          {
            "id": "part-hh5ch23",
            "videoName": "Borris_A.mov",
            "introText": "“When the lights go on, this beast goes wild. It’s not finesse, it’s not subtle — it’s just pure power from Borris!”"
          },
          {
            "id": "part-fdrxhj5",
            "introText": "Locked, loaded, and ready to send the competition sky-high — this vertical spinner is here to take a byte out of anyone in its way! Give it up for… KILLABYYYYTE!"
          }
        ],
        "winner": {
          "id": "part-hh5ch23",
          "condition": "KO"
        }
      },
      {
        "id": "match-pebvjez",
        "name": "Match 7",
        "participants": [
          {
            "id": "hfk4hiu",
            "introText": "“You hear that? That’s not just drums — it’s doom on delivery! Get your sticks ready and your chassis steady for Drumroll Pls!”"
          },
          {
            "id": "3osxali",
            "introText": "“Spinning, shifting, and tearing it all apart — this puzzle doesn’t solve, it shatters! From the mind of madness, it’s Tessellate!”"
          }
        ],
        "winner": {
          "id": "hfk4hiu",
          "condition": "KO"
        }
      },
      {
        "id": "match-whm6nig",
        "name": "Match 8",
        "participants": [
          {
            "id": "rot076r",
            "videoName": "Haymaker_A.mov",
            "introText": "“From the corner of the pit comes a punch you won’t see coming! He’s winding up, loading up, and ready to drop jaws — brace for Haymaker!”"
          },
          {
            "id": "part-04xspbq",
            "videoName": "Bad_Blood_A.mov",
            "introText": "“There’s history, there’s hostility, and there’s one bot that thrives on both. Tauranga’s coldest fighter is back to spill some Bad Blood!”"
          }
        ],
        "winner": {
          "id": "part-04xspbq",
          "condition": "JD"
        }
      },
      {
        "id": "match-3fb63h2",
        "name": "Match 9",
        "participants": [
          {
            "id": "part-dllub2q",
            "videoName": "Mjolnir_A.mov",
            "introText": "“Lightning? Thunder? Nah, that’s just the sound of this monster winding up! When he swings, the earth trembles — fear the wrath of Mjolnir!”"
          },
          {
            "id": "0a41c0a",
            "videoName": "Obliterator_A",
            "introText": "From the land down under comes the bot they call the most feared in Australia — a horizontal spinner built to shred anything that dares to enter the arena. Driven by James Kirby, make some noise for… OBLITERAAAATOR!"
          }
        ],
        "winner": {
          "id": "0a41c0a",
          "condition": "JD"
        }
      }
    ],
    "name": "Qualifying Session 2"
  },
  {
    "id": "schedule-dspw9e4",
    "type": "EXHIBITION",
    "matches": [
      {
        "id": "match-dmtkwg1",
        "name": "Match 1",
        "participants": [
          {
            "id": "s9xj92s"
          },
          {
            "id": "96j1t3r"
          }
        ],
        "winner": {
          "id": "96j1t3r",
          "condition": "JD"
        }
      }
    ],
    "name": "Exhibition 1"
  },
  {
    "id": "schedule-mlmbk07",
    "type": "QUALIFYING",
    "matches": [
      {
        "id": "match-5z7bad6",
        "name": "Match 1",
        "participants": [
          {
            "id": "part-aw653qy",
            "introText": "These lil guys are twins, but they aren't identical. One is gonna pin you down while the other cracks through your clavicle. You think you'll be fine by taking one down, but they'll stop at nothing. Put your hands together for SNOLLYGOSTER AND RAGAMUFFIN"
          },
          {
            "id": "part-y3konnp",
            "videoName": "Onlyforks_A.mov",
            "introText": "If you set this robot loose on a bunch of birds.. the sounds you hear will be only Squawks.... but if you wanted to come dine on destruction, then you've made the right choice, GIVE IT UP FOR ONLY FOOOORKS"
          }
        ],
        "winner": {
          "id": "part-y3konnp",
          "condition": "KO"
        }
      },
      {
        "id": "match-wau9jf5",
        "name": "Match 2",
        "participants": [
          {
            "id": "puvpwxl",
            "videoName": "Fury_Fox_A.mov",
            "introText": "You might think he's a little upset, but don't get it twisted, this bot is gonna hit you so hard and leave you wishing you never existed. Give it up for FUUUURY FOX"
          },
          {
            "id": "8pii4jf",
            "introText": "This bot has strategy- don't let him get behind you or he'll put you in a sleeper hold. And if that don't work, he's taking a hammer through you and putting your lights out COLD. Say goodnight- to NAPTIIIIME"
          }
        ],
        "winner": {
          "id": "puvpwxl",
          "condition": "KO"
        }
      },
      {
        "id": "match-sx84ebk",
        "name": "Match 3",
        "participants": [
          {
            "id": "3osxali",
            "introText": "This melty brain will run circles around you- and itself! If you're going up against this bot, then your best bet is to wrestle it. Make some noise and give it up. It's TESSELAATE"
          },
          {
            "id": "part-qpm0bjg",
            "videoName": "Black_Rose_A.mov",
            "introText": "This robot is our champion from last event, they've been fighting since time's dawn. And if you're trying to take their crown from them, you're bound to catch their thorns. I can't believe they make me write prose but anyway put your hands together for BLAAAAAAACK ROOOOOOSE"
          }
        ],
        "winner": {
          "id": "part-qpm0bjg",
          "condition": "KO"
        }
      },
      {
        "id": "match-qj21rso",
        "name": "Match 4",
        "participants": [
          {
            "id": "part-dx6qvml",
            "introText": "The great mind of Archimedes once said \"if you give me a lever long enough and a place to stand and I shall move the world\". But this bot doesn't care about that. It has a single focus and that is to send opponents closer to the sun than any robot should come. Ladies and gentlemen, make some noise for FULCRUM!"
          },
          {
            "id": "part-uov2lni",
            "introText": "This bot is like a reactor, once it spins up it's gonna be a chain reaction. He hits so hard you should take some panadol.. or tramadol- yknow- so you can pain manage. Everybody please put your hands together for CHAIN DAMAAAAGE"
          }
        ],
        "winner": {
          "id": "part-uov2lni",
          "condition": "JD"
        }
      },
      {
        "id": "match-7vha1kk",
        "name": "Match 5",
        "participants": [
          {
            "id": "part-odwrzot",
            "videoName": "Chef_Woody_A.mov",
            "introText": "Excuse me waiter, I'd like to order the chef special- Yeah that's right, I'd like one fight full of destruction please- and make it a goody.. cause it's not like robots grow on trees.. oh except this one. GIVE IT UP FOR CHEF WOODYYY"
          },
          {
            "id": "luecccm",
            "introText": "If you're in the ring but you can't see your opponent you will have to use more of your senses. Take a sniff, taste the air... wait.... Hear that noise? Listen to that baby purrrr. Now MAKE SOME NOISE, and give it up, FOR BLUE BLURRRR"
          }
        ],
        "winner": {
          "id": "luecccm",
          "condition": "KO"
        }
      },
      {
        "id": "match-ze3yddn",
        "name": "Match 6",
        "participants": [
          {
            "id": "part-hh5ch23",
            "videoName": "Borris_A.mov",
            "introText": "This bot is a bully. It's fuelled on pure hate. Should you run for the hills? No... you should run for a forest... When it comes out the gate, nothing will save you from BORRIS"
          },
          {
            "id": "uvy1k73",
            "introText": "This thing is named after a mammal, so it's about to get hairy. This mammal also gives milk? So I hope you're not intolerant to dairy.. Give us a big roar and say hello to .... PERRRYYYYY"
          }
        ],
        "winner": {
          "id": "part-hh5ch23",
          "condition": "KO"
        }
      },
      {
        "id": "match-rh2n2pd",
        "name": "Match 7",
        "participants": [
          {
            "id": "part-fdrxhj5",
            "videoName": "Borris_A.mov",
            "introText": "This bot is gonna leave you in bits and... MORE BITS. They clearly have a good dentist because they can clearly chomp through their enemies! Everybody pleaaase make some noise for KILLABYTEEEE"
          },
          {
            "id": "part-04xspbq",
            "videoName": "Bad_Blood_A.mov",
            "introText": "When this robot outmanoeuvres you and there's nothing you can do cause their driver is so good? That's a Shane... And he's here de Rijk the floor with his opponent. Ohhhhh. no.... This can't be good... Oh that makes sense.. because it's BAAAAAAD BLOOOOOD"
          }
        ],
        "winner": {
          "id": "part-04xspbq",
          "condition": "KO"
        }
      },
      {
        "id": "match-gvyc9o5",
        "name": "Match 8",
        "participants": [
          {
            "id": "hfk4hiu",
            "introText": "The hum of the motors, the whirr of the weapon, and the bang of the drum. This isn't some humdrum nobody who can be bested with ease. They're here to bring the noise, the pain, and the DRUMS. OHHHYEAEAAAAAH It's DRUMROLL PLEAAASE"
          },
          {
            "id": "0a41c0a",
            "videoName": "Obliterator_A.mov",
            "introText": "This. Is the robot that all the other robots are taught by their parents to fear. If you don't go to sleep on time... From all the way across the ditch he's gonna come and get ya! Awwwuer Naur It's OBLITERATORRR!"
          }
        ],
        "winner": {
          "id": "0a41c0a",
          "condition": "JD"
        }
      },
      {
        "id": "match-k0246of",
        "name": "Match 9",
        "participants": [
          {
            "id": "part-dllub2q",
            "videoName": "Mjolnir_A.mov",
            "introText": "(story time) They say the dwarven brothers Sindri and Brokkr forged a hammer so powerful they needed to enchant it to protect the unworthy from wielding it. Well.. turns out there is one here who is worthy, and they only made the weapon more appropriate for the time. This is a robot you won't wanna roll near, bring the thunder, for MJOOOOLNIIIIIIIR"
          },
          {
            "id": "rot076r",
            "videoName": "Haymaker_A.mov",
            "introText": "In his spare time he mows lawns and spreads the grass out to dry. But in his professional fighting career he's gonna copy and paste the same strategy. He's going to cut you to size and hang you out to dry- it's HAYMAKER"
          }
        ],
        "winner": {
          "id": "part-dllub2q",
          "condition": "KO"
        }
      }
    ],
    "name": "Qualifying Session 3"
  },
  {
    "id": "schedule-zhrklgp",
    "type": "BRACKET",
    "matches": [
      {
        "id": "match-h01kaq6",
        "name": "Championship QF1",
        "participants": [
          {
            "id": "part-hh5ch23",
            "introText": "They say that he counted to infinity... Twice! This bot must be the robot Chuck Norris. Everybody, please put your hands together for BORRIS!"
          },
          {
            "id": "part-04xspbq",
            "introText": "This robot doesn't even have a heart, and somehow all that runs through his veins is rage, haemoglobin, and mud. Everybody, please put your hands together for BAAD BLOOOOD"
          }
        ],
        "bracket": "Championship",
        "round": "QF1",
        "winner": {
          "id": "part-04xspbq",
          "condition": "JD"
        }
      },
      {
        "id": "match-uf9ibm7",
        "name": "Championship QF3",
        "participants": [
          {
            "id": "part-dllub2q",
            "introText": "From the depths of the forge and the fury of the storm... wielding the power of the gods and the bite of a thousand blades... it's the hammer that doesn't fall—it spins! With a weapon that strikes like thunder and armor forged for war, brace yourselves for the Norse nightmare... this is Mjolnir!"
          },
          {
            "id": "part-y3konnp",
            "introText": "Look, this is just dining cutlery etiquette. On the right hand side of the dish you can have your knives and spoons et cetera... But the left side and in the BLUE square, that's purely reserved for ONLY FOOOOORKS"
          }
        ],
        "bracket": "Championship",
        "round": "QF4",
        "winner": {
          "id": "part-y3konnp",
          "condition": "KO"
        }
      },
      {
        "id": "match-qyq2o36",
        "name": "9th Place QF4",
        "participants": [
          {
            "id": "8pii4jf",
            "introText": "Rolling into the arena with a deceptively chill vibe, this may just be the tournaments sleeper bot! Everyone grab your blankets and shhhhhhhhh.... It's naap tiiime"
          },
          {
            "id": "rot076r",
            "introText": "This bot hits HARD- a real armour breaker. You'll feel the arena shake, this bot's an earthquaker. The force of the blow is gonna send you to Jamaica! Everybody give it up foor HAYMAKER"
          }
        ],
        "bracket": "9th Place",
        "round": "QF2",
        "winner": {
          "id": "rot076r",
          "condition": "KO"
        }
      },
      {
        "id": "match-ocld65n",
        "name": "9th Place QF1",
        "participants": [
          {
            "id": "part-aw653qy",
            "introText": "One minibot is going to make some room and push you around- Then the other sends you to the moon and let you splatter on the ground. Seriously, it's gonna hurt- the robot equivalent of a concussion. MAKE SOME NOISE It's Snollygoster and Ragamuffin!"
          },
          {
            "id": "part-odwrzot",
            "introText": "Other bots have hearts of steel- but this bot has a heart of oak! Forget branches and grain, cause he's serving carrots, and pain. You don't think he'd go easy on you, would he? Brace yourselves, for CHEF WOOODYYYYY"
          }
        ],
        "bracket": "9th Place",
        "round": "QF1",
        "winner": {
          "id": "part-aw653qy",
          "condition": "JD"
        }
      },
      {
        "id": "match-avww33e",
        "name": "9th Place QF3",
        "participants": [
          {
            "id": "luecccm",
            "introText": "With an impressive weapon disc like lightning dipped in cobalt. Rivals get picked apart, till they've got no nuts and nobolts. He'll hit you once, twice, three times- and let that damage recur- Please make some noise and a big welcome to BLUE BLURRRR"
          },
          {
            "id": "part-uov2lni",
            "introText": "They say this thwackbot was chained up in robo prison for committing crazy robo crimes.. But he broke free of his bonds, and now, they're his main weapon! IT'S CHAIN DAMAAAGE"
          }
        ],
        "bracket": "9th Place",
        "round": "QF4",
        "winner": {
          "id": "part-uov2lni",
          "condition": "KO"
        }
      },
      {
        "id": "match-t4a0f5g",
        "name": "9th Place QF2",
        "participants": [
          {
            "id": "3osxali",
            "introText": "Watch him slice, dice and rearrange his opponents into a mosaic of defeat. Every hit they make they calculate, each opponent they face they dominate, and any rest assured- they'll give us a reason to celebrate. Make some noise! It's TESSELATE!"
          },
          {
            "id": "part-fdrxhj5",
            "introText": "When this bot boots up, opponents start debugging their strategy, because this machine is programmed for destruction. Coming to battle with blades of vengeance and bytes of fury... it's KILLABYTE!"
          }
        ],
        "bracket": "9th Place",
        "round": "QF3",
        "winner": {
          "id": "part-fdrxhj5",
          "condition": "KO"
        }
      },
      {
        "id": "match-8h4q85l",
        "name": "Championship QF4",
        "participants": [
          {
            "id": "part-qpm0bjg",
            "introText": "He's lining up his enemies, then he switches to attack mode. If you come at him with long forks, oof- he's gonna snap those. That double barreled drum spinner... don't let it get THAT close. Ladies and gentlemen, give it up one time for BLACK ROSE."
          },
          {
            "id": "puvpwxl",
            "introText": "He's cunning, he's sneaky, he thinks outside the box. He's spinny, he's ANGRYY, he came from the school of hard knocks. They say hell hath no fury, but that's because Team Sly Robotics took it, and used it to fuel FUUURY FOXXXX"
          }
        ],
        "bracket": "Championship",
        "round": "QF2",
        "winner": {
          "id": "part-qpm0bjg",
          "condition": "KO"
        }
      },
      {
        "id": "match-ndvnh3p",
        "name": "Championship QF2",
        "participants": [
          {
            "id": "0a41c0a",
            "introText": "With a horizontal spinner the size of your worst nightmare this bot doesn’t just hit—it erases. When it starts spinning, the laws of physics start sweating. Rivals don’t get dismantled—they get deleted. Watch as he turns the battlefield into a scrapyard. Everyone make some noise for OBLITERATOOOOOR"
          },
          {
            "id": "uvy1k73",
            "introText": "HAHAHAHAaaa my nemesis I finaally caught you!!! You silly little semi aquatic mammal of action-Wait.. is that a robot?! Oh my goodness it's PERRY THE ROBOT!?"
          }
        ],
        "bracket": "Championship",
        "round": "QF3",
        "winner": {
          "id": "0a41c0a",
          "condition": "KO"
        }
      }
    ],
    "name": "Bracket 1"
  },
  {
    "id": "schedule-qmnmpw7",
    "type": "BRACKET",
    "matches": [
      {
        "id": "match-4096jmb",
        "name": "9th Place SF1",
        "participants": [
          {
            "id": "part-aw653qy"
          },
          {
            "id": "rot076r"
          }
        ],
        "bracket": "9th Place",
        "round": "SF1"
      },
      {
        "id": "match-ja44th4",
        "name": "9th Place SF2",
        "participants": [
          {
            "id": "part-fdrxhj5"
          },
          {
            "id": "part-uov2lni"
          }
        ],
        "bracket": "9th Place",
        "round": "SF2"
      },
      {
        "id": "match-q9foy7r",
        "name": "Championship SF1",
        "participants": [
          {
            "id": "part-04xspbq"
          },
          {
            "id": "part-qpm0bjg"
          }
        ],
        "bracket": "Championship",
        "round": "SF1"
      },
      {
        "id": "match-kwoyr5d",
        "name": "Championship SF2",
        "participants": [
          {
            "id": "0a41c0a"
          },
          {
            "id": "part-y3konnp"
          }
        ],
        "bracket": "Championship",
        "round": "SF2"
      },
      {
        "id": "match-4ls944v",
        "name": "Bot Rumble",
        "participants": [
          {},
          {}
        ],
        "bracket": "",
        "round": "SF1"
      },
      {
        "id": "match-013hjsn",
        "name": "5th Place",
        "participants": [
          {
            "id": "part-hh5ch23"
          },
          {
            "id": "part-dllub2q"
          }
        ],
        "bracket": "",
        "round": "SF1"
      },
      {
        "id": "match-29gir5u",
        "name": "3rd Place",
        "participants": [
          {},
          {}
        ],
        "bracket": "",
        "round": "SF1"
      },
      {
        "id": "match-h7v1r9e",
        "name": "11th Place",
        "participants": [
          {},
          {}
        ],
        "bracket": "",
        "round": "SF1"
      },
      {
        "id": "match-t3a7r4l",
        "name": "9th Place Final",
        "participants": [
          {},
          {}
        ],
        "bracket": "9th Place",
        "round": "Final"
      },
      {
        "id": "match-3amx1cg",
        "name": "Championship Final",
        "participants": [
          {},
          {}
        ],
        "bracket": "Championship",
        "round": "Final"
      }
    ],
    "name": "Bracket 2"
  }
]